Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hsmc.h
/* -------- HSMC_MODE5 : (HSMC Offset: 0x5C) (R/W 32) HSMC Mode Register (CS_number = 5) -------- */
#define HSMC_MODE5_READ_MODE_Pos              _U_(0)                                               /**< (HSMC_MODE5) Read Mode Position */
#define HSMC_MODE5_READ_MODE_Msk              (_U_(0x1) << HSMC_MODE5_READ_MODE_Pos)               /**< (HSMC_MODE5) Read Mode Mask */
#define HSMC_MODE5_READ_MODE(value)           (HSMC_MODE5_READ_MODE_Msk & ((value) << HSMC_MODE5_READ_MODE_Pos))
#define HSMC_MODE5_WRITE_MODE_Pos             _U_(1)                                               /**< (HSMC_MODE5) Write Mode Position */
#define HSMC_MODE5_WRITE_MODE_Msk             (_U_(0x1) << HSMC_MODE5_WRITE_MODE_Pos)              /**< (HSMC_MODE5) Write Mode Mask */
#define HSMC_MODE5_WRITE_MODE(value)          (HSMC_MODE5_WRITE_MODE_Msk & ((value) << HSMC_MODE5_WRITE_MODE_Pos))
#define HSMC_MODE5_RMW_ENABLE_Pos             _U_(2)                                               /**< (HSMC_MODE5) Read-Modify Write enable Position */
#define HSMC_MODE5_RMW_ENABLE_Msk             (_U_(0x1) << HSMC_MODE5_RMW_ENABLE_Pos)              /**< (HSMC_MODE5) Read-Modify Write enable Mask */
#define HSMC_MODE5_RMW_ENABLE(value)          (HSMC_MODE5_RMW_ENABLE_Msk & ((value) << HSMC_MODE5_RMW_ENABLE_Pos))
#define HSMC_MODE5_EXNW_MODE_Pos              _U_(4)                                               /**< (HSMC_MODE5) NWAIT Mode Position */
#define HSMC_MODE5_EXNW_MODE_Msk              (_U_(0x3) << HSMC_MODE5_EXNW_MODE_Pos)               /**< (HSMC_MODE5) NWAIT Mode Mask */
#define HSMC_MODE5_EXNW_MODE(value)           (HSMC_MODE5_EXNW_MODE_Msk & ((value) << HSMC_MODE5_EXNW_MODE_Pos))
#define   HSMC_MODE5_EXNW_MODE_DISABLED_Val   _U_(0x0)                                             /**< (HSMC_MODE5) Disabled-The NWAIT input signal is ignored on the corresponding chip select.  */
#define   HSMC_MODE5_EXNW_MODE_FROZEN_Val     _U_(0x2)                                             /**< (HSMC_MODE5) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.  */
#define   HSMC_MODE5_EXNW_MODE_READY_Val      _U_(0x3)                                             /**< (HSMC_MODE5) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.  */
#define HSMC_MODE5_EXNW_MODE_DISABLED         (HSMC_MODE5_EXNW_MODE_DISABLED_Val << HSMC_MODE5_EXNW_MODE_Pos) /**< (HSMC_MODE5) Disabled-The NWAIT input signal is ignored on the corresponding chip select. Position  */
#define HSMC_MODE5_EXNW_MODE_FROZEN           (HSMC_MODE5_EXNW_MODE_FROZEN_Val << HSMC_MODE5_EXNW_MODE_Pos) /**< (HSMC_MODE5) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped. Position  */
#define HSMC_MODE5_EXNW_MODE_READY            (HSMC_MODE5_EXNW_MODE_READY_Val << HSMC_MODE5_EXNW_MODE_Pos) /**< (HSMC_MODE5) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high. Position  */
#define HSMC_MODE5_DBW_Pos                    _U_(8)                                               /**< (HSMC_MODE5) Data Bus Width Position */
#define HSMC_MODE5_DBW_Msk                    (_U_(0x3) << HSMC_MODE5_DBW_Pos)                     /**< (HSMC_MODE5) Data Bus Width Mask */
#define HSMC_MODE5_DBW(value)                 (HSMC_MODE5_DBW_Msk & ((value) << HSMC_MODE5_DBW_Pos))
#define   HSMC_MODE5_DBW_8_BIT_Val            _U_(0x0)                                             /**< (HSMC_MODE5) 8-bit Data Bus  */
#define   HSMC_MODE5_DBW_16_BIT_Val           _U_(0x1)                                             /**< (HSMC_MODE5) 16-bit Data Bus  */
#define   HSMC_MODE5_DBW_32_BIT_Val           _U_(0x2)                                             /**< (HSMC_MODE5) 32-bit Data Bus  */
#define HSMC_MODE5_DBW_8_BIT                  (HSMC_MODE5_DBW_8_BIT_Val << HSMC_MODE5_DBW_Pos)     /**< (HSMC_MODE5) 8-bit Data Bus Position  */
#define HSMC_MODE5_DBW_16_BIT                 (HSMC_MODE5_DBW_16_BIT_Val << HSMC_MODE5_DBW_Pos)    /**< (HSMC_MODE5) 16-bit Data Bus Position  */
#define HSMC_MODE5_DBW_32_BIT                 (HSMC_MODE5_DBW_32_BIT_Val << HSMC_MODE5_DBW_Pos)    /**< (HSMC_MODE5) 32-bit Data Bus Position  */
#define HSMC_MODE5_Msk                        _U_(0x00000337)                                      /**< (HSMC_MODE5) Register Mask  */


/* -------- HSMC_WPMR : (HSMC Offset: 0x70) (R/W 32) HSMC Write Protection Mode Register -------- */
#define HSMC_WPMR_WPEN_Pos                    _U_(0)                                               /**< (HSMC_WPMR) Write Protect Enable Position */
#define HSMC_WPMR_WPEN_Msk                    (_U_(0x1) << HSMC_WPMR_WPEN_Pos)                     /**< (HSMC_WPMR) Write Protect Enable Mask */
#define HSMC_WPMR_WPEN(value)                 (HSMC_WPMR_WPEN_Msk & ((value) << HSMC_WPMR_WPEN_Pos))
#define HSMC_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (HSMC_WPMR) Write Protection Key Position */
#define HSMC_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << HSMC_WPMR_WPKEY_Pos)               /**< (HSMC_WPMR) Write Protection Key Mask */
#define HSMC_WPMR_WPKEY(value)                (HSMC_WPMR_WPKEY_Msk & ((value) << HSMC_WPMR_WPKEY_Pos))
#define   HSMC_WPMR_WPKEY_PASSWD_Val          _U_(0x534D43)                                        /**< (HSMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define HSMC_WPMR_WPKEY_PASSWD                (HSMC_WPMR_WPKEY_PASSWD_Val << HSMC_WPMR_WPKEY_Pos)  /**< (HSMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define HSMC_WPMR_Msk                         _U_(0xFFFFFF01)                                      /**< (HSMC_WPMR) Register Mask  */


/* -------- HSMC_WPSR : (HSMC Offset: 0x74) ( R/ 32) HSMC Write Protection Status Register -------- */
#define HSMC_WPSR_WPVS_Pos                    _U_(0)                                               /**< (HSMC_WPSR) Write Protection Violation Status Position */
#define HSMC_WPSR_WPVS_Msk                    (_U_(0x1) << HSMC_WPSR_WPVS_Pos)                     /**< (HSMC_WPSR) Write Protection Violation Status Mask */
#define HSMC_WPSR_WPVS(value)                 (HSMC_WPSR_WPVS_Msk & ((value) << HSMC_WPSR_WPVS_Pos))
#define HSMC_WPSR_WPVSRC_Pos                  _U_(8)                                               /**< (HSMC_WPSR) Write Protection Violation Source Position */
#define HSMC_WPSR_WPVSRC_Msk                  (_U_(0xFFFF) << HSMC_WPSR_WPVSRC_Pos)                /**< (HSMC_WPSR) Write Protection Violation Source Mask */
#define HSMC_WPSR_WPVSRC(value)               (HSMC_WPSR_WPVSRC_Msk & ((value) << HSMC_WPSR_WPVSRC_Pos))
#define HSMC_WPSR_Msk                         _U_(0x00FFFF01)                                      /**< (HSMC_WPSR) Register Mask  */


/** \brief HSMC register offsets definitions */
#define HSMC_SETUP0_REG_OFST           (0x00)              /**< (HSMC_SETUP0) HSMC Setup Register (CS_number = 0) Offset */
#define HSMC_PULSE0_REG_OFST           (0x04)              /**< (HSMC_PULSE0) HSMC Pulse Register (CS_number = 0) Offset */
#define HSMC_CYCLE0_REG_OFST           (0x08)              /**< (HSMC_CYCLE0) HSMC Cycle Register (CS_number = 0) Offset */
#define HSMC_MODE0_REG_OFST            (0x0C)              /**< (HSMC_MODE0) HSMC Mode Register (CS_number = 0) Offset */
#define HSMC_SETUP1_REG_OFST           (0x10)              /**< (HSMC_SETUP1) HSMC Setup Register (CS_number = 1) Offset */
#define HSMC_PULSE1_REG_OFST           (0x14)              /**< (HSMC_PULSE1) HSMC Pulse Register (CS_number = 1) Offset */
#define HSMC_CYCLE1_REG_OFST           (0x18)              /**< (HSMC_CYCLE1) HSMC Cycle Register (CS_number = 1) Offset */
#define HSMC_MODE1_REG_OFST            (0x1C)              /**< (HSMC_MODE1) HSMC Mode Register (CS_number = 1) Offset */
#define HSMC_SETUP2_REG_OFST           (0x20)              /**< (HSMC_SETUP2) HSMC Setup Register (CS_number = 2) Offset */
#define HSMC_PULSE2_REG_OFST           (0x24)              /**< (HSMC_PULSE2) HSMC Pulse Register (CS_number = 2) Offset */
#define HSMC_CYCLE2_REG_OFST           (0x28)              /**< (HSMC_CYCLE2) HSMC Cycle Register (CS_number = 2) Offset */
#define HSMC_MODE2_REG_OFST            (0x2C)              /**< (HSMC_MODE2) HSMC Mode Register (CS_number = 2) Offset */
#define HSMC_SETUP3_REG_OFST           (0x30)              /**< (HSMC_SETUP3) HSMC Setup Register (CS_number = 3) Offset */
#define HSMC_PULSE3_REG_OFST           (0x34)              /**< (HSMC_PULSE3) HSMC Pulse Register (CS_number = 3) Offset */
#define HSMC_CYCLE3_REG_OFST           (0x38)              /**< (HSMC_CYCLE3) HSMC Cycle Register (CS_number = 3) Offset */
#define HSMC_MODE3_REG_OFST            (0x3C)              /**< (HSMC_MODE3) HSMC Mode Register (CS_number = 3) Offset */
#define HSMC_SETUP4_REG_OFST           (0x40)              /**< (HSMC_SETUP4) HSMC Setup Register (CS_number = 4) Offset */
#define HSMC_PULSE4_REG_OFST           (0x44)              /**< (HSMC_PULSE4) HSMC Pulse Register (CS_number = 4) Offset */
#define HSMC_CYCLE4_REG_OFST           (0x48)              /**< (HSMC_CYCLE4) HSMC Cycle Register (CS_number = 4) Offset */
#define HSMC_MODE4_REG_OFST            (0x4C)              /**< (HSMC_MODE4) HSMC Mode Register (CS_number = 4) Offset */
#define HSMC_SETUP5_REG_OFST           (0x50)              /**< (HSMC_SETUP5) HSMC Setup Register (CS_number = 5) Offset */
#define HSMC_PULSE5_REG_OFST           (0x54)              /**< (HSMC_PULSE5) HSMC Pulse Register (CS_number = 5) Offset */
#define HSMC_CYCLE5_REG_OFST           (0x58)              /**< (HSMC_CYCLE5) HSMC Cycle Register (CS_number = 5) Offset */
#define HSMC_MODE5_REG_OFST            (0x5C)              /**< (HSMC_MODE5) HSMC Mode Register (CS_number = 5) Offset */
#define HSMC_WPMR_REG_OFST             (0x70)              /**< (HSMC_WPMR) HSMC Write Protection Mode Register Offset */
#define HSMC_WPSR_REG_OFST             (0x74)              /**< (HSMC_WPSR) HSMC Write Protection Status Register Offset */

