Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hsmc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief HSMC register API structure */
typedef struct
{
  __IO  uint32_t                       HSMC_SETUP0;        /**< Offset: 0x00 (R/W  32) HSMC Setup Register (CS_number = 0) */
  __IO  uint32_t                       HSMC_PULSE0;        /**< Offset: 0x04 (R/W  32) HSMC Pulse Register (CS_number = 0) */
  __IO  uint32_t                       HSMC_CYCLE0;        /**< Offset: 0x08 (R/W  32) HSMC Cycle Register (CS_number = 0) */
  __IO  uint32_t                       HSMC_MODE0;         /**< Offset: 0x0C (R/W  32) HSMC Mode Register (CS_number = 0) */
  __IO  uint32_t                       HSMC_SETUP1;        /**< Offset: 0x10 (R/W  32) HSMC Setup Register (CS_number = 1) */
  __IO  uint32_t                       HSMC_PULSE1;        /**< Offset: 0x14 (R/W  32) HSMC Pulse Register (CS_number = 1) */
  __IO  uint32_t                       HSMC_CYCLE1;        /**< Offset: 0x18 (R/W  32) HSMC Cycle Register (CS_number = 1) */
  __IO  uint32_t                       HSMC_MODE1;         /**< Offset: 0x1C (R/W  32) HSMC Mode Register (CS_number = 1) */
  __IO  uint32_t                       HSMC_SETUP2;        /**< Offset: 0x20 (R/W  32) HSMC Setup Register (CS_number = 2) */
  __IO  uint32_t                       HSMC_PULSE2;        /**< Offset: 0x24 (R/W  32) HSMC Pulse Register (CS_number = 2) */
  __IO  uint32_t                       HSMC_CYCLE2;        /**< Offset: 0x28 (R/W  32) HSMC Cycle Register (CS_number = 2) */
  __IO  uint32_t                       HSMC_MODE2;         /**< Offset: 0x2C (R/W  32) HSMC Mode Register (CS_number = 2) */
  __IO  uint32_t                       HSMC_SETUP3;        /**< Offset: 0x30 (R/W  32) HSMC Setup Register (CS_number = 3) */
  __IO  uint32_t                       HSMC_PULSE3;        /**< Offset: 0x34 (R/W  32) HSMC Pulse Register (CS_number = 3) */
  __IO  uint32_t                       HSMC_CYCLE3;        /**< Offset: 0x38 (R/W  32) HSMC Cycle Register (CS_number = 3) */
  __IO  uint32_t                       HSMC_MODE3;         /**< Offset: 0x3C (R/W  32) HSMC Mode Register (CS_number = 3) */
  __IO  uint32_t                       HSMC_SETUP4;        /**< Offset: 0x40 (R/W  32) HSMC Setup Register (CS_number = 4) */
  __IO  uint32_t                       HSMC_PULSE4;        /**< Offset: 0x44 (R/W  32) HSMC Pulse Register (CS_number = 4) */
  __IO  uint32_t                       HSMC_CYCLE4;        /**< Offset: 0x48 (R/W  32) HSMC Cycle Register (CS_number = 4) */
  __IO  uint32_t                       HSMC_MODE4;         /**< Offset: 0x4C (R/W  32) HSMC Mode Register (CS_number = 4) */
  __IO  uint32_t                       HSMC_SETUP5;        /**< Offset: 0x50 (R/W  32) HSMC Setup Register (CS_number = 5) */
  __IO  uint32_t                       HSMC_PULSE5;        /**< Offset: 0x54 (R/W  32) HSMC Pulse Register (CS_number = 5) */
  __IO  uint32_t                       HSMC_CYCLE5;        /**< Offset: 0x58 (R/W  32) HSMC Cycle Register (CS_number = 5) */
  __IO  uint32_t                       HSMC_MODE5;         /**< Offset: 0x5C (R/W  32) HSMC Mode Register (CS_number = 5) */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       HSMC_WPMR;          /**< Offset: 0x70 (R/W  32) HSMC Write Protection Mode Register */
  __I   uint32_t                       HSMC_WPSR;          /**< Offset: 0x74 (R/   32) HSMC Write Protection Status Register */
} hsmc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH71_HSMC_COMPONENT_H_ */
